000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-accept.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     77 A PIC X(40).
000007 
000008 PROCEDURE DIVISION.
000009   main.
000010     ACCEPT A.
000011     DISPLAY A.
000012     STOP RUN.
000013 END PROGRAM ex-accept.
