000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. helloworld.
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     77 A PIC X(40).
000008 PROCEDURE DIVISION.
000009   main.
000010     ACCEPT A FROM COMMAND-LINE.
000011     DISPLAY A.
