000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-arrays.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     01 array.
000007       02 i PIC 9.
000008       02 j PIC 9.
000009       02   array1 OCCURS 3.
000010         03 array2 OCCURS 2 PIC 99.
000011 
000012 PROCEDURE DIVISION.
000013   main.
000014     PERFORM VARYING i FROM 1 BY 1 UNTIL i > 3
000015       PERFORM VARYING j FROM 1 BY 1 UNTIL j > 2
000016         DISPLAY array2 (i, j) SPACE NO ADVANCING
000017       END-PERFORM
000018       DISPLAY SPACES
000019     END-PERFORM.
000020     STOP RUN.
000021 END PROGRAM ex-arrays.