000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000003 DATA DIVISION.
000004   WORKING-STORAGE SECTION.
000005     01 TempDate PIC X(10).
000006     01 DateCheckResult PIC X(10).
000007 PROCEDURE DIVISION.
000008 main.
000009 CALL "Hello"
000010     USING BY CONTENT TempDate
000011           BY REFERENCE DateCheckResult.
000012 END PROGRAM a.

000013 IDENTIFICATION DIVISION.
000014 PROGRAM-ID. Hello.
000015 DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
        01 DateParam            PIC X(10).
        01 DateResult           PIC X(10).
000016 PROCEDURE DIVISION USING DateParam DateResult.
000017   DISPLAY "Hello world !"
000018   EXIT PROGRAM.
000019 END PROGRAM Hello.