000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. SALUTTOUS.
000300 DATE-WRITTEN. 21/05/05 19:04.
000400 AUTHOR. UNKNOWN.
000500 ENVIRONMENT DIVISION.
000600 CONFIGURATION SECTION.
000700 SOURCE-COMPUTER. RM-COBOL.
000800 OBJECT-COMPUTER. RM-COBOL.
000900
001000 DATA DIVISION.
001100 FILE SECTION.
001200
100000 PROCEDURE DIVISION.
100100
100200 DEBUT.
100300 DISPLAY " " LINE 1 POSITION 1.
100400 DISPLAY "BONJOUR !" LINE 15 POSITION 10.
100500 STOP RUN.
