000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000000 ENVIRONMENT DIVISION.
000000  CONFIGURATION SECTION.
000000    SOURCE-COMPUTER. i486.
000000    OBJECT-COMPUTER. Alpha 
000000    PROGRAM COLLATING SEQUENCE IS ALPH-A.
000000    SPECIAL-NAMES.  Alphabet ALPH-A is standard-1.
