000000  IDENTIFICATION DIVISION.
000000   PROGRAM-ID. PROG60.
000000  ENVIRONMENT DIVISION.
000000  DATA DIVISION.
000000  WORKING-STORAGE SECTION.
000000  01  A                   PIC S9(04)V9(04)
000000                          VALUE +1.
000000  01  B                   PIC S9(04)V9(04)
000000                          VALUE -5.
000000  01  C                   PIC S9(04)V9(04)
000000                          VALUE +6.
000000
000000  01  ALPHA               PIC ---9.9(04).
000000  01  BETA                PIC ---9.9(04).
000000  01  DELTA               PIC S9(04)V9(04).
000000  01  DISCRIMINANT        PIC S9(04)V9(04).
000000
000000  PROCEDURE DIVISION.
000000  0000-MAINLINE.
000000
000000      COMPUTE DELTA = (B ** 2) - (4 * A * C)
000000      COMPUTE DISCRIMINANT = DELTA ** 0.50
000000      COMPUTE ALPHA = ((-1 * B) + DISCRIMINANT) / (2 * A)
000000      COMPUTE BETA  = ((-1 * B) - DISCRIMINANT) / (2 * A)
000000
000000      DISPLAY 'ALPHA = ' ALPHA ' BETA = ' BETA                    
000000
000000      STOP RUN.
