000000 identification division.
000000 program-id. extfile.
000000  DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000000 01  IMAGE-STATUS              PIC S9(4) COMP.
000000  88 IMAGE-OK                  VALUE ZERO.
000000  88 IMAGE-ERROR                   VALUE -9999 THRU -1,
000000                                         +1 THRU +9999.
000000  88 IMAGE-BEG-OF-FILE             VALUE 10 12.
000000  88 IMAGE-END-OF-FILE             VALUE 11 13.
000000  88 IMAGE-BEG-OF-CHAIN            VALUE 14.
000000  88 IMAGE-END-OF-CHAIN            VALUE 15.
000000  88 IMAGE-DSET-FULL               VALUE 16.
000000  88 IMAGE-NO-ENTRY                VALUE 17.
000000  88 IMAGE-LOCK-FAILURE            VALUE 20 THRU 25.
