000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-display.
000003 
000004 PROCEDURE DIVISION.
000005   main.
000006     DISPLAY "hello".
000007 END PROGRAM ex-display.
