000000   IDENTIFICATION DIVISION.
000000   PROGRAM-ID. HELLO.
000000*   DATA DIVISION.
000000*      WORKING-STORAGE SECTION.
000000*      01 WS-NUM1 PIC 9(9) VALUE 5.
000000*      01 WS-NUM2 PIC 9(9) VALUE 250.
000000*      01 WS-NUM3 PIC 9(9) VALUE 280.
000000*      01 WS-NUMA PIC 9(9) VALUE 100.
000000*      01 WS-NUMB PIC 9(9) VALUE 15.
000000*      01 WS-NUMC PIC 9(9).
000000*      01 WS-NUMD PIC 9(9).
000000*      01 WS-REM PIC 9(9). 
000000   
000000   PROCEDURE DIVISION.
          DIVIDE 1 INTO WS-NUM2.
          DIVIDE 5 INTO WS-NUM2 WS-NUM3.
          DIVIDE 9 INTO WS-NUM2, WS-NUM3.
          DIVIDE WS-NUM1 INTO WS-NUM2.
          DIVIDE WS-NUM1 INTO WS-NUM2 WS-NUM3.
          DIVIDE WS-NUM1 INTO WS-NUM2, WS-NUM3.

          DIVIDE WS-NUMA BY 12 GIVING WS-NUMC.
          DIVIDE 3 BY WS-NUMB GIVING WS-NUMC WS-NUMD.
          DIVIDE 3 BY 12 GIVING WS-NUMC WS-NUMD.
          DIVIDE WS-NUMA BY WS-NUMB GIVING WS-NUMC.
          DIVIDE WS-NUMA BY WS-NUMB GIVING WS-NUMC WS-NUMD.
          DIVIDE WS-NUMA INTO 12 GIVING WS-NUMC.
          DIVIDE 3 INTO WS-NUMB GIVING WS-NUMC WS-NUMD.
          DIVIDE 3 INTO 12 GIVING WS-NUMC WS-NUMD.
          DIVIDE WS-NUMA INTO WS-NUMB GIVING WS-NUMC.
          DIVIDE WS-NUMA INTO WS-NUMB GIVING WS-NUMC WS-NUMD.

          DIVIDE WS-NUM1 INTO WS-NUM2 ROUNDED.
          DIVIDE WS-NUM1 INTO WS-NUM2 ROUNDED WS-NUM3.
          DIVIDE WS-NUM1 INTO WS-NUM2 ROUNDED, WS-NUM3 ROUNDED.
          DIVIDE WS-NUMA BY WS-NUMB GIVING WS-NUMC ROUNDED.
          DIVIDE WS-NUMA BY WS-NUMB
                   GIVING WS-NUMC ROUNDED WS-NUMD ROUNDED.

000000      DIVIDE WS-NUM1 INTO WS-NUM2 GIVING WS-NUM3 REMAINDER WS-REM.
000000      DIVIDE WS-NUMA BY WS-NUMB GIVING WS-NUMC REMAINDER WS-REM.


000000   STOP RUN.
