       IDENTIFICATION DIVISION.
       PROGRAM-ID. MainProgram.
        ENVIRONMENT DIVISION.
         CONFIGURATION SECTION.
           SOURCE-COMPUTER. i486.
           OBJECT-COMPUTER. i486.