000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-functions.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     77 x PIC 999.
000007     77 y PIC 999.
000008     77 z PIC 999.
000009 
000010 PROCEDURE DIVISION.
000011   saisie.
000012     DISPLAY "x=" NO ADVANCING ACCEPT x.
000013     DISPLAY "y=" NO ADVANCING ACCEPT y.
000014     DISPLAY "z=" NO ADVANCING ACCEPT z.
000015 
000016   appel-func.
000017     DISPLAY "min=" FUNCTION MIN (x, y, z).
000018     DISPLAY "max=" FUNCTION MAX (x, y, z).
000019   STOP RUN.
000020 END PROGRAM ex-functions.