000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000000 ENVIRONMENT DIVISION.
000000  CONFIGURATION SECTION.
000000   SPECIAL-NAMES.
000000   CLASS WS-VALID-EMAIL IS
000000       '@' '_' '.'
000000       'a' THRU 'i'
000000       'j' THRU 'r'
000000       's' THRU 'z'
000000       '0' THRU '9'.
000003 DATA DIVISION.
000004 WORKING-STORAGE SECTION.
000000 77 TYTY PIC A(2)X(2) VALUE "a".
000000 01 TATA.
000000  03 TITI PIC 9(2) VALUE 12.
000000  03 TOTO.
000000   05 TOTO-IN PIC X(1) VALUE 'N'.
000000   05 TOTO-IF PIC X(1) VALUE 'F'.
000000*AAAAAAAAAAAAAAAAAAAAAA
000000 01 AAAA PIC 9(3)X(2).
000000 01 TUTU PIC 9(2)X(2).
000000 01 TOTO1 PIC 9(2).
000000 77 TOTO2 PIC A(30).
000000 77 TOTO3 PIC X(30).
000000 01 TOTO4 PIC N(30).
000000 01 TOTO5 PIC 9(5)V9(5).
000000   88 ByVisa         VALUE 1, 7.
000000   88 ByAccess       VALUE 2.
000000   88 ByExpress      VALUE 3 THRU 6.
000000 01 array  PIC 99 OCCURS 10.
000000 PROCEDURE DIVISION.
000000 aaaaaa.
000000 IF WS-EMAIL IS NOT WS-VALID-EMAIL
000000    DISPLAY "EMAIL ADDRESS IS INVALID."
000000 ELSE
000000    DISPLAY "EMAIL ADDRESS IS VALID."
000000 END-IF.
000004 main.
000000 COMPUTE ALPHA = ((-1 * B) + DISCRIMINANT) / (2 * A)
000000 ACCEPT A FROM COMMAND-LINE.
000000 STOP RUN.
000000*EVALUATE TRUE
000000*  WHEN ByVisa DISPLAY "Evaluate !"
000000*END-EVALUATE.
000000 SET ByVisa TO TRUE.
000000 PERFORM TEST AFTER UNTIL FALSE
000000   DISPLAY "Hello"
000000 END-PERFORM.
000000*PERFORM VARYING compteur FROM 1 BY 2 UNTIL compteur > 10
000000*  DISPLAY "olleH"
000000*END-PERFORM.
000000 main2.
000000 SET TITI TO 15.
000010   DISPLAY TYTY.
000010   DISPLAY TOTO.
000010   DISPLAY TOTO-IN.
000000 IF TATA = "+" THEN
000004   CALL "amax"
000000 END-IF.
000000 IF TOTO = "+" THEN
000004   CALL "amax"
000000 END-IF.
000000 IF TOTO-IN = "+" THEN
000004   CALL "amax"
000000 END-IF.
000006 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. amax.
000008 DATA DIVISION.
000009 PROCEDURE DIVISION.
000010   DISPLAY "Hello world !".
000011 EXIT PROGRAM.
000012 END PROGRAM amax.
000013 END PROGRAM a.
000006 IDENTIFICATION DIVISION.
000007 PROGRAM-ID. bmax.
000008 DATA DIVISION.
000009 PROCEDURE DIVISION.
000010   DISPLAY "Hello bmax !".
000012 END PROGRAM bmax.
