       IDENTIFICATION DIVISION.
       PROGRAM-ID. premier-programme.

       PROCEDURE DIVISION.
       paragraphe-principal.
         hello-world.
           DISPLAY "Hello World !".
           STOP RUN.
 
           END PROGRAM premier-programme.
