000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000003 DATA DIVISION.
000003 WORKING-STORAGE SECTION.
000004 01 TATA PIC 9 VALUE 5.
000005 PROCEDURE DIVISION.
000006 main.
000007 DISPLAY "Hello World !".
000008 function.
000009 DISPLAY "Hello World !".