000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-arrays.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000000    01  A PIC 9. 
000000    PROCEDURE DIVISION.
000000         ACCEPT A 
000000         IF A EQUAL TO 2
                 MULTIPLY 2 BY A
      		 END-MULTIPLY
000000         ELSE
                 IF A EQUAL TO 3 
000000              CONTINUE
000000         END-IF.
