       IDENTIFICATION DIVISION.
       PROGRAM-ID. a.
       Procedure division.
       IF 1 = 1
      * DEPRECATED STATEMENT
         NEXT SENTENCE
       ELSE
           DISPLAY "Not reached"
       END-IF
       DISPLAY "This is NOT the NEXT SENTENCE"
       DISPLAY "This is NOT the NEXT SENTENCE too".
       DISPLAY "This IS the NEXT SENTENCE".
