000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. mymove.
000003 
000004* DATA DIVISION.
000005*   WORKING-STORAGE SECTION.
000000*   77  WS-A     PIC   999   VALUE     000.
000000*   77  WS-B     PIC    99   VALUE      22.
000000*   77  WS-C     PIC    99   VALUE      12.
000000*   77  WS-NAME  PIC  X(4)   VALUE  'JOHN'.
000008 
000009 PROCEDURE DIVISION.
000010   main.
          DISPLAY "test".
000000    MOVE 345 TO WS-A.
000000    MOVE "JACOB" TO WS-NAME.
000000    MOVE WS-A TO WS-B.
          MOVE 42 TO WS-B, WS-C.
000000 
000016 END PROGRAM mymove.
