000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-boucle.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     77 k        PIC 99.
000007     77 compteur PIC 99.
000008 
000009 PROCEDURE DIVISION.
000010   main.
000011     DISPLAY "k : " NO ADVANCING ACCEPT k.
000012     PERFORM VARYING compteur FROM 1 BY 2 UNTIL compteur > k
000013       DISPLAY compteur " ; " NO ADVANCING
000014     END-PERFORM.
000015     STOP RUN.
000016 END PROGRAM ex-boucle.
