000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. boucle.
000003 
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000006     77 phrase PIC X(40).
000007     77 n      PIC 99.
000008 
000009 PROCEDURE DIVISION.
000010   main.
000011     DISPLAY "Phrase : " NO ADVANCING ACCEPT phrase.
000012     DISPLAY "Répétitions : " NO ADVANCING ACCEPT n.
000013     PERFORM n TIMES
000014       DISPLAY phrase
000015     END-PERFORM.
000016     STOP RUN.
000017 END PROGRAM boucle.