000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. ex-condition.
000003
000004 DATA DIVISION.
000005   WORKING-STORAGE SECTION.
000000 01  EXEMPLE1.
000000     02  VARIABLE1 PIC 9(4).
000000     02  VARIABLE2 REDEFINES VARIABLE1 PIC X(4).
000000 
000000 01  EXEMPLE2.
000000    02  STRUCTURE.
000000       03  A PIC X(20).
000000       03  B PIC 9(4).
000000    02  BLOC REDEFINES STRUCTURE PIC X(24).
