       IDENTIFICATION DIVISION.
        PROGRAM-ID. MainProgram.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          SOURCE-COMPUTER. IBM-370.
          SPECIAL-NAMES.
            ALPHABET REV-ALPHA IS "Z" THROUGH "A",
               "z" THROUGH "a".
