       IDENTIFICATION DIVISION.
         PROGRAM-ID. MainProgram.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       	 SOURCE-COMPUTER. IBM-370.
         SPECIAL-NAMES.
           CURRENCY SIGN IS '$'.
