       IDENTIFICATION DIVISION.
         PROGRAM-ID. MainProgram.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
         SPECIAL-NAMES.
         ALPHABET REV-ALPHA IS "Z" THROUGH "D",
           "z" THROUGH "d", "a" also "b" also "c".
