       IDENTIFICATION DIVISION.
        PROGRAM-ID. MainProgram.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
          SOURCE-COMPUTER. IBM-370.
          SPECIAL-NAMES.
       ALPHABET NO-CASE IS 1 THRU 65,   'A' ALSO 'a',    
           'B' ALSO 'b',   'C' ALSO 'c',   'D' ALSO 'd',    
           'E' ALSO 'e',   'F' ALSO 'f',   'G' ALSO 'g',    
           'H' ALSO 'h',   'I' ALSO 'i',   'J' ALSO 'j',    
           'K' ALSO 'k',   'L' ALSO 'l',   'M' ALSO 'm',    
           'N' ALSO 'n',   'O' ALSO 'o',   'P' ALSO 'p',    
           'Q' ALSO 'q',   'R' ALSO 'r',   'S' ALSO 's',    
           'T' ALSO 't',   'U' ALSO 'u',   'V' ALSO 'v',    
           'W' ALSO 'w',   'X' ALSO 'x',   'Y' ALSO 'y',    
           'Z' ALSO 'z'.
