000001 IDENTIFICATION DIVISION.
000002   PROGRAM-ID. useless.
000003 
000004 PROCEDURE DIVISION.
000005   main.
000006     STOP RUN.
000007 END PROGRAM useless.