000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000003 PROCEDURE DIVISION.
000004 main.
000004 CALL "amax".
000006 IDENTIFICATION DIVISION.
000007 PROGRAM-ID. amax.
000008 DATA DIVISION.
000009 PROCEDURE DIVISION.
000010   DISPLAY "Hello world !".
000011 EXIT PROGRAM.
000012 END PROGRAM amax.
000013 END PROGRAM a.
000006 IDENTIFICATION DIVISION.
000007 PROGRAM-ID. bmax.
000008 DATA DIVISION.
000009 PROCEDURE DIVISION.
000010   DISPLAY "Hello bmax !".
000012 END PROGRAM bmax.
