000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. a.
000003 DATA DIVISION.
000004 PROCEDURE DIVISION.
000005 main.
000006 CALL "hello".
000007 END PROGRAM a.
000008 IDENTIFICATION DIVISION.
000009 PROGRAM-ID. hello.
000010 DATA DIVISION.
000011 PROCEDURE DIVISION.
000012   DISPLAY "Hello world !"
000013 EXIT PROGRAM.
000014 END PROGRAM hello.