       IDENTIFICATION DIVISION.
       PROGRAM-ID. LetterSearchAll.
      
        DATA DIVISION.
        WORKING-STORAGE SECTION.
          77 StudentId PIC 9(7).
          01 WS-NUM1 PIC 9(9) VALUE 5.
